---
kind: type
id: T:Autodesk.Revit.DB.ContourSetting
source: html/273ba072-c140-14c8-3000-24bac8337dd2.htm
---
# Autodesk.Revit.DB.ContourSetting

Contour setting object that handles the contour information used to draw contours on elements.

## Syntax (C#)
```csharp
public class ContourSetting : IDisposable
```